# 2. Для списка реализовать обмен значений соседних элементов.
# Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т. д.
# При нечётном количестве элементов последний сохранить на своём месте.
# Для заполнения списка элементов нужно использовать функцию input().

elem_count = int(input("Введите количество элементов: "))
list_1 = []
i = 0
el = 0
while i < elem_count:
    list_1.append(input("Введите следующее значение списка "))
    i += 1

for elem_count in range(int(len(list_1)/2)):
        list_1[el], list_1[el + 1] = list_1 [el + 1], list_1[el]
        el += 2
print(list_1)